public class Main {
    public static void main(String[] args) {
//        Задача номер 1
//        int m [] = {5, 24, 3, 66, 38, 16, 27};
//        int i = 4;
//        System.out.println("string " + FirstJob.oneTask(m, i) );


//  Задача номер 2
//    InputParameter a = new InputParameter();
//    a.minLength = 8;
//    a.maxLength = 15;
//    System.out.println("Установленные требования к логину и паролю");
//    System.out.println("Минимум "+ a.minLength + " символов" + " Максимум "+ a.maxLength + " символов");
//    System.out.println("Введите Login");
//    inpStr("LOGIN", a);
//    a.login = a.temp;
//    System.out.println("Введите Password");
//    inpStr("PASSWORD", a);
//    a.password = a.temp;
//    System.out.println("Введенные данные: Логин " + a.login + "  Пароль " + a.password);
//
//    }
//    public static InputParameter inpStr (String oper, InputParameter prm){
//        boolean state = true;
//        while (state){
//            String temp = LogAndPas.inpPrm();
//            if (temp.length()< prm.minLength){
//                state = true;
//                System.out.println(oper + " не соответствует требованиям");
//                System.out.println("Повторите еще раз");
//            } else if (temp.length() >  prm.maxLength) {
//                state = true;
//                System.out.println(oper + " не соответствует требованиям");
//                System.out.println("Повторите еще раз");
//            }else{
//                state = false;
//                prm.temp = temp;
//            }
//        }
//        return prm;
//    }


//    Задача номер 3
//        String a [] [] = {"Саша", "Игорь", "Миша", "Коля", "Владимир"};

        System.out.println("Повторите еще раз");
    }
}